In [24]:
import pandas as pd
import datetime

In [25]:
url = "https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html"

In [26]:
tables = pd.read_html(url)
tables

[        id terrestrial_date   sol   ls  month  min_temp  pressure
 0        2       2012-08-16    10  155      6     -75.0     739.0
 1       13       2012-08-17    11  156      6     -76.0     740.0
 2       24       2012-08-18    12  156      6     -76.0     741.0
 3       35       2012-08-19    13  157      6     -74.0     732.0
 4       46       2012-08-20    14  157      6     -74.0     740.0
 ...    ...              ...   ...  ...    ...       ...       ...
 1862  1889       2018-02-23  1973  133      5     -78.0     730.0
 1863  1892       2018-02-24  1974  134      5     -77.0     729.0
 1864  1894       2018-02-25  1975  134      5     -76.0     729.0
 1865  1893       2018-02-26  1976  135      5     -77.0     728.0
 1866  1895       2018-02-27  1977  135      5     -77.0     727.0

 [1867 rows x 7 columns]]

In [27]:
df = tables[0]

In [28]:
df

        id terrestrial_date   sol   ls  month  min_temp  pressure
0        2       2012-08-16    10  155      6     -75.0     739.0
1       13       2012-08-17    11  156      6     -76.0     740.0
2       24       2012-08-18    12  156      6     -76.0     741.0
3       35       2012-08-19    13  157      6     -74.0     732.0
4       46       2012-08-20    14  157      6     -74.0     740.0
...    ...              ...   ...  ...    ...       ...       ...
1862  1889       2018-02-23  1973  133      5     -78.0     730.0
1863  1892       2018-02-24  1974  134      5     -77.0     729.0
1864  1894       2018-02-25  1975  134      5     -76.0     729.0
1865  1893       2018-02-26  1976  135      5     -77.0     728.0
1866  1895       2018-02-27  1977  135      5     -77.0     727.0

[1867 rows x 7 columns]

In [29]:
df = df.iloc[1:]
df.set_index('id', inplace=True)

In [30]:
df = df.sort_values('id')

In [31]:
df = df.astype({'sol': 'int'})

In [32]:
df.dtypes

terrestrial_date     object
sol                   int32
ls                    int64
month                 int64
min_temp            float64
pressure            float64
dtype: object

In [33]:
df["terrestrial_date"]= pd.to_datetime(df["terrestrial_date"])

In [34]:
df.dtypes

terrestrial_date    datetime64[ns]
sol                          int32
ls                           int64
month                        int64
min_temp                   float64
pressure                   float64
dtype: object

In [35]:
df

     terrestrial_date   sol   ls  month  min_temp  pressure
id
3          2012-11-16   100  207      7     -66.0     829.0
4          2012-11-17   101  208      7     -65.0     830.0
5          2012-11-18   102  209      7     -67.0     833.0
6          2012-11-19   103  209      7     -66.0     836.0
7          2012-11-20   104  210      8     -67.0     838.0
...               ...   ...  ...    ...       ...       ...
1891       2018-02-22  1972  133      5     -78.0     730.0
1892       2018-02-24  1974  134      5     -77.0     729.0
1893       2018-02-26  1976  135      5     -77.0     728.0
1894       2018-02-25  1975  134      5     -76.0     729.0
1895       2018-02-27  1977  135      5     -77.0     727.0

[1866 rows x 6 columns]

In [36]:
df.to_csv("mars.csv")